In [3]:
import pandas as pd
import numpy as np

In [4]:
a = pd.Series([1,2,np.nan])

In [5]:
a

0    1.0
1    2.0
2    NaN
dtype: float64

In [6]:
a.sum()

3.0

In [8]:
df = pd.DataFrame({'A':[1,2],'B':[3,4]})

In [9]:
df

   A  B
0  1  3
1  2  4

In [10]:
df.dtypes

A    int64
B    int64
dtype: object

In [11]:
df = pd.DataFrame(np.random.randn(6,4))

In [12]:
df

          0         1         2         3
0 -0.034416 -0.737234 -0.612138  0.362727
1  1.478312  0.415721  1.257596  0.374948
2  0.535133 -0.084086  1.209690  1.533070
3 -0.326385  1.032610  0.527456 -0.336301
4 -0.209773 -1.066792  2.092213  1.141139
5  0.953100  0.890307 -1.167152 -1.061912

In [14]:
df = pd.DataFrame(np.random.randn(6,4),index=pd.date_range('20190101',periods=6))

In [15]:
df

                   0         1         2         3
2019-01-01  2.144679  0.334391 -0.635431 -0.313504
2019-01-02 -0.997551  0.383092  0.978920 -0.756225
2019-01-03 -0.900753  2.430568  1.288285 -0.795234
2019-01-04 -0.287955  0.671049  0.609143  0.068534
2019-01-05  1.786800  0.729760 -0.379497  0.001532
2019-01-06  1.732319  1.542229  0.173998  0.052852

In [16]:
df = pd.DataFrame(np.random.randn(6,4),index=pd.date_range('20190101',periods=6),columns=['A','B','C','D'])

In [17]:
df

                   A         B         C         D
2019-01-01 -0.091405 -1.478532 -0.185756 -0.506213
2019-01-02 -1.429072  0.310596 -1.197186 -1.040244
2019-01-03  0.832163 -0.795521 -0.258867  0.330925
2019-01-04  0.882887 -0.129445 -0.003825 -0.378586
2019-01-05 -0.380321 -2.797253 -0.061892 -0.345486
2019-01-06  2.208832 -0.992699 -1.638948  0.117933

In [18]:
df.head(1)

                   A         B         C         D
2019-01-01 -0.091405 -1.478532 -0.185756 -0.506213

In [19]:
df.tail(3)

                   A         B         C         D
2019-01-04  0.882887 -0.129445 -0.003825 -0.378586
2019-01-05 -0.380321 -2.797253 -0.061892 -0.345486
2019-01-06  2.208832 -0.992699 -1.638948  0.117933

In [20]:
df.index

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06'],
              dtype='datetime64[ns]', freq='D')

In [21]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [22]:
df.values

array([[-0.09140473, -1.47853217, -0.18575641, -0.50621293],
       [-1.42907225,  0.31059641, -1.19718626, -1.04024391],
       [ 0.83216332, -0.79552068, -0.25886715,  0.33092548],
       [ 0.88288678, -0.12944472, -0.00382465, -0.3785855 ],
       [-0.38032123, -2.79725341, -0.06189181, -0.34548553],
       [ 2.20883191, -0.9926992 , -1.6389479 ,  0.11793252]])

In [24]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.337181 -0.980476 -0.557746 -0.303612
std    1.254115  1.093089  0.686773  0.484022
min   -1.429072 -2.797253 -1.638948 -1.040244
25%   -0.308092 -1.357074 -0.962606 -0.474306
50%    0.370379 -0.894110 -0.222312 -0.362036
75%    0.870206 -0.295964 -0.092858  0.002078
max    2.208832  0.310596 -0.003825  0.330925

In [25]:
df.T

   2019-01-01  2019-01-02  2019-01-03  2019-01-04  2019-01-05  2019-01-06
A   -0.091405   -1.429072    0.832163    0.882887   -0.380321    2.208832
B   -1.478532    0.310596   -0.795521   -0.129445   -2.797253   -0.992699
C   -0.185756   -1.197186   -0.258867   -0.003825   -0.061892   -1.638948
D   -0.506213   -1.040244    0.330925   -0.378586   -0.345486    0.117933

In [26]:
df.sort_values(by='B')

                   A         B         C         D
2019-01-05 -0.380321 -2.797253 -0.061892 -0.345486
2019-01-01 -0.091405 -1.478532 -0.185756 -0.506213
2019-01-06  2.208832 -0.992699 -1.638948  0.117933
2019-01-03  0.832163 -0.795521 -0.258867  0.330925
2019-01-04  0.882887 -0.129445 -0.003825 -0.378586
2019-01-02 -1.429072  0.310596 -1.197186 -1.040244

In [27]:
df[0:3]

                   A         B         C         D
2019-01-01 -0.091405 -1.478532 -0.185756 -0.506213
2019-01-02 -1.429072  0.310596 -1.197186 -1.040244
2019-01-03  0.832163 -0.795521 -0.258867  0.330925

In [28]:
df['20190101':'20190103']

                   A         B         C         D
2019-01-01 -0.091405 -1.478532 -0.185756 -0.506213
2019-01-02 -1.429072  0.310596 -1.197186 -1.040244
2019-01-03  0.832163 -0.795521 -0.258867  0.330925

In [29]:
df.loc['20190101']

A   -0.091405
B   -1.478532
C   -0.185756
D   -0.506213
Name: 2019-01-01 00:00:00, dtype: float64

In [33]:
df.loc['20190101'],['A','b']

(A   -0.091405
 B   -1.478532
 C   -0.185756
 D   -0.506213
 Name: 2019-01-01 00:00:00, dtype: float64, ['A', 'b'])

In [35]:
df.iloc[0,0]

-0.09140472821686564

In [38]:
df[df.C > 0]

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [39]:
df[df > 0]

                   A         B   C         D
2019-01-01       NaN       NaN NaN       NaN
2019-01-02       NaN  0.310596 NaN       NaN
2019-01-03  0.832163       NaN NaN  0.330925
2019-01-04  0.882887       NaN NaN       NaN
2019-01-05       NaN       NaN NaN       NaN
2019-01-06  2.208832       NaN NaN  0.117933

In [40]:
df

                   A         B         C         D
2019-01-01 -0.091405 -1.478532 -0.185756 -0.506213
2019-01-02 -1.429072  0.310596 -1.197186 -1.040244
2019-01-03  0.832163 -0.795521 -0.258867  0.330925
2019-01-04  0.882887 -0.129445 -0.003825 -0.378586
2019-01-05 -0.380321 -2.797253 -0.061892 -0.345486
2019-01-06  2.208832 -0.992699 -1.638948  0.117933

In [41]:
df2 = df.copy()

In [43]:
df2

                   A         B         C         D
2019-01-01 -0.091405 -1.478532 -0.185756 -0.506213
2019-01-02 -1.429072  0.310596 -1.197186 -1.040244
2019-01-03  0.832163 -0.795521 -0.258867  0.330925
2019-01-04  0.882887 -0.129445 -0.003825 -0.378586
2019-01-05 -0.380321 -2.797253 -0.061892 -0.345486
2019-01-06  2.208832 -0.992699 -1.638948  0.117933

In [45]:
s = pd.Series([1,2,3,4,5,6],index=pd.date_range('20191201',periods=6))

In [46]:
s

2019-12-01    1
2019-12-02    2
2019-12-03    3
2019-12-04    4
2019-12-05    5
2019-12-06    6
Freq: D, dtype: int64

In [47]:
df.shift(1)

                   A         B         C         D
2019-01-01       NaN       NaN       NaN       NaN
2019-01-02 -0.091405 -1.478532 -0.185756 -0.506213
2019-01-03 -1.429072  0.310596 -1.197186 -1.040244
2019-01-04  0.832163 -0.795521 -0.258867  0.330925
2019-01-05  0.882887 -0.129445 -0.003825 -0.378586
2019-01-06 -0.380321 -2.797253 -0.061892 -0.345486

In [48]:
df = pd.DataFrame(np.random.randn(2,2))

In [49]:
df

          0         1
0 -0.559745 -0.393447
1  0.988162  0.638795

In [50]:
pd.concat([df,df])

          0         1
0 -0.559745 -0.393447
1  0.988162  0.638795
0 -0.559745 -0.393447
1  0.988162  0.638795

In [53]:
df = pd.DataFrame(np.random.randn(8,3),columns=['A','B','C'])

In [54]:
df

          A         B         C
0  1.632080 -0.839384  0.349593
1 -0.154675  0.356376 -0.343450
2 -0.572020  1.164564 -1.050344
3 -1.090878 -0.057550  0.831309
4  0.241698  1.261791 -1.224935
5 -0.999082 -0.785852  0.973328
6 -1.042016  0.947987  1.337688
7 -1.370538 -0.258265 -0.546094

In [55]:
df.iloc[0]

A    1.632080
B   -0.839384
C    0.349593
Name: 0, dtype: float64

In [56]:
a.append(s)

0                      1.0
1                      2.0
2                      NaN
2019-12-01 00:00:00    1.0
2019-12-02 00:00:00    2.0
2019-12-03 00:00:00    3.0
2019-12-04 00:00:00    4.0
2019-12-05 00:00:00    5.0
2019-12-06 00:00:00    6.0
dtype: float64

In [57]:
df.append(s,ignore_index=True)

,A,B,C,2019-12-01 00:00:00,2019-12-02 00:00:00,2019-12-03 00:00:00,2019-12-04 00:00:00,2019-12-05 00:00:00,2019-12-06 00:00:00
0,1.632080,-0.839384,0.349593,NaN,NaN,NaN,NaN,NaN,NaN
1,-0.154675,0.356376,-0.343450,NaN,NaN,NaN,NaN,NaN,NaN
2,-0.572020,1.164564,-1.050344,NaN,NaN,NaN,NaN,NaN,NaN
3,-1.090878,-0.057550,0.831309,NaN,NaN,NaN,NaN,NaN,NaN
4,0.241698,1.261791,-1.224935,NaN,NaN,NaN,NaN,NaN,NaN
5,-0.999082,-0.785852,0.973328,NaN,NaN,NaN,NaN,NaN,NaN
6,-1.042016,0.947987,1.337688,NaN,NaN,NaN,NaN,NaN,NaN
7,-1.370538,-0.258265,-0.546094,NaN,NaN,NaN,NaN,NaN,NaN
8,NaN,NaN,NaN,1.0,2.0,3.0,4.0,5.0,6.0

In [59]:
df = pd.DataFrame({'A':['foo','bar','foo','bar'],'B':np.random.rand(4)})

In [60]:
df

     A         B
0  foo  0.990220
1  bar  0.244660
2  foo  0.288186
3  bar  0.921670

In [61]:
df.groupby('A').sum()

            B
A
bar  1.166330
foo  1.278406

In [62]:
import pandas_datareader

In [64]:
s = pandas_datareader.data.DataReader('AAPL','yahoo','2014-01-01')

In [66]:
s.head(1)

                 High       Low       Open      Close      Volume  Adj Close
Date
2013-12-31  80.182854  79.14286  79.167145  80.145714  55771100.0  72.121513